Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: The structure (or schema) against which the data is exported and validated is defined in the file pwsafe.xsd, which is provided as part of the distribution.
ru_ru: Структура (схема) для экспорта и проверки документа определена в файле pwsafe.xsd, который идёт в комплекте с Password Safe.

source: The style sheet to convert the KeePass XML file to a Password Safe XML file is: KPV1_to_PWS.xslt or KPV2_to_PWS.xslt.
ru_ru: Имя шаблона для преобразования XML-файла KeePass в XML-файл Password Safe: KPV1_to_PWS.xslt или KPV2_to_PWS.xslt.

source: The supported formats are:
ru_ru: Поддерживаются следующие форматы:

source: The text 'Ctrl+Alt+P' will appear in the Shortcut Key field, and once you press OK, the change will take effect.
ru_ru: Текст «Ctrl+Alt+P» появится в поле «Комбинация...» выбранной строки. Изменения вступят в силу после нажатия «OK».

source: The text between these will be imported as the 'Title' of this entry.
ru_ru: Текст из этой строки считается заголовком элемента.

source: The time is stored with the entry, and may be viewed in the entry's dialog box.
ru_ru: Время хранится вместе с элементом и может быть просмотрено в диалоге редактирования/просмотра элемента.

source: The title and password are the only mandatory fields for an entry.
ru_ru: Только поля «заголовок» и «пароль» являются обязательными.

source: The toolbar itself is also customizable.
ru_ru: Сама панель инструментов тоже может быть настроена.

source: The toolbar itself is customizable.
ru_ru: Сама панель инструментов тоже может быть настроена.

source: The upper table lists the filters, and the lower table displays the contents of the currently selected filter.
ru_ru: В верхней перечислены фильтры, а в нижней — условия, определённые в выбранном фильтре.

source: The use of \# instead of \z may prevent issues with sending non-Latin characters in other parts of the AutoType string as can happen when using the \z field.
ru_ru: Использование «\#» вместо «\z» возможно предотвратит некоторые проблемы, связанные с автонабором нелатинских символов, которые иногда встречаются при использовании «\z».

source: The value you specify will be used as-is with no changes.
ru_ru: Указанное значение будет использовано без изменений (как есть).

source: The values substituded in that string, e.g., \p for password, come for the shortcut's base entry, except for the fields that can be set for the shortcut itself, namely its group, title and user.
ru_ru: Подстановки полей, например, \p для пароля, используют значения из исходного элемента, за исключением тех, что принадлежат самому ярлыку (группа, заголовок, имя пользователя).

source: The values you have specified for the "Advanced field selection criteria" will still remain but will not be used.
ru_ru: Указанные «Расширенные условия отбора» сохранятся, но не будут использованы.

source: The variable and its value, if present, will be removed from the string that is executed.
ru_ru: При этом переменная и её значение будут убраны из строки параметров.

source: The variable name is terminated either by encountering a non-alphanumeric character (such as a space) or the end of the Run Command.
ru_ru: Имя переменной заканчивается перед символом отличным от буквы и цифры (например, пробел) или концом команды.

source: The virtual keyboard can be shown by clicking on the symbol.
ru_ru: Для отображения экранной клавиатуры нужно нажать кнопку .

source: The virtual keyboard can be shown by pushing the symbol .
ru_ru: Для отображения экранной клавиатуры нужно нажать кнопку .

source: The width of the first column in the List View when Password Safe was last exited
ru_ru: Ширина первого столбца при прошлом выходе из Password Safe

source: The width of the fourth column in the List View when Password Safe was last exited
ru_ru: Ширина четвёртого столбца при прошлом выходе из Password Safe

source: The width of the second column in the List View when Password Safe was last exited
ru_ru: Ширина второго столбца при прошлом выходе из Password Safe

source: The width of the third column in the List View when Password Safe was last exited
ru_ru: Ширина третьего столбца при прошлом выходе из Password Safe

source: The year in full.
ru_ru: Год в четырёхзначном виде.

source: Then you can simply drag and drop any entries or groups from your open database to this 'export' database.
ru_ru: Затем перетяните необходимые элементы или группы в новый контейнер.

source: Then you can simply drag and drop any entries or groups to your open database from this 'import' database.
ru_ru: Затем перетяните из него необходимые элементы или группы в первый контейнер.

source: There appears to be an issue using the new AutoType Dragbar image with Internet Explorer (tested with V7, V8 & V9) in that any characters typed before the first tab character are lost.
ru_ru: Похоже, что в Internet Explorer (V7, V8 и V9) автонабор с панели «Dragbar» работает не совсем корректно: теряются символы до первой табуляции.

source: There are a number of options available to the user if differences are detected:
ru_ru: Для отличающихся элементов списка возможны следующие действия:

source: There are two different views available for toolbar icons: new and classic.
ru_ru: Доступно два стиля отображения значков на панели инструментов: «современный» и «классический».

source: There are two ways that a new database can be created.
ru_ru: Контейнер можно создать двумя способами.

source: There is also a graphical front-end for Saxon called Kernow.
ru_ru: Для Saxon также существует графическая оболочка Kernow.

source: There is no restriction on the order of the 'column headings'. Password Safe will use the supplied Title Row to correctly add the specified data to the right field.
ru_ru: Порядок столбцов может быть любым. Соответствие полей определяется по заголовкам.

source: There is no restriction on the order of the “column headings”. Password Safe will use the supplied Title Row to correctly add the specified data to the right field.
ru_ru: Порядок столбцов может быть любым. Соответствие полей определяется по заголовкам.

source: There is now a menu item ( "View → Show Entries with Expiry dates") that will invoke an internal filter to display all those entries with an expiry date set, whether it be not yet expired, soon to expire or already expired.
ru_ru: Пункт меню Вид→Показать элементы с заданными датами истечения пароля применяет внутренний фильтр, отображающий только те элементы, у которых задана дата истечения пароля (независимо от того, наступила она или нет).

source: Therefore, although a warning is shown if you select an entry keyboard shortcut that is currently assigned to a menu item, there may not be a conflict if you later customise the menu shortcuts or change the application display language.
ru_ru: По этой причине, если вы выберете для элемента ту же комбинацию клавиш, что уже назначена для пункта меню, будет выведено предупреждение. Это не приведёт к конфликта настроек, если позже вы измените язык локализации приложения или установите другую комбинацию для пункта меню.

source: Therefore, as of version 3.22, the configuration file (pwsafe.cfg) will be created in the standard location for such files (in the user's 'Application Data' directory).
ru_ru: Поэтому, начиная с версии 3.22, файл настроек (pwsafe.cfg) создаётся в стандартном для файлов такого рода месте — в профиле пользователя внутри каталога «Application Data».

source: Therefore, if they are ommited during rename, they will retain their previous values.
ru_ru: Но, если их не указать при переименовании, будут использоваться их предыдущие значения.

source: Therefore, if you add a group and the database is saved before you add an entry in it or its sub-group, it will disappear.
ru_ru: Таким образом, если сохранить контейнер сразу после создания группы (до того, как в группу или её подгруппу будут добавлены элементы), группа исчезнет.

source: Therefore, it is not possible to assign this key to a function.
ru_ru: Поэтому невозможно переназначить её для вызова той или иной функции.

source: Therefore, it is not possible to assign this key.
ru_ru: Поэтому её невозможно переназначить.

source: Therefore, we strongly recommend that you make regular copies of you password database 'off-line', that is, to another PC or disk.
ru_ru: Поэтому, рекомендуется регулярно создавать резервные копии контейнера с паролями на другом носителе или компьютере.

source: Therefore, we strongly recommend that you make regular copies of your password database 'off-line', that is, to another PC or disk.
ru_ru: Поэтому, рекомендуется регулярно создавать резервные копии контейнера с паролями на другом носителе или компьютере.

source: These must precede the code and can be combined in any order.
ru_ru: Они должны идти до соответствующей управляющей последовательности и могут комбинироваться в произвольном порядке.

source: These are database specific and are stored in the database header.
ru_ru: Политики привязаны к контейнеру и хранятся в заголовке контейнера.

source: These are shown in the Shortcut Property Page as 'Delete' and 'Rename', respectively.
ru_ru: Поэтому, соответствующие действия на вкладке «Комбинации клавиш» названы просто «Удалить» и «Переименовать».

source: These are shown in the Shortcut Property Page as just 'Delete' and 'Rename' respectively.
ru_ru: Поэтому, соответствующие действия на вкладке «Комбинации клавиш» названы просто «Удалить» и «Переименовать».

source: These backups should be stored somewhere safe.
ru_ru: Резервные копии следует хранить в безопасном месте.

source: These come from the alias's base entry.
ru_ru: Они берутся из исходного элемента.

source: These controls allow you to configure how many recently opened databases are displayed in the File menu.
ru_ru: Здесь вы можете указать количество запоминаемых контейнеров, отображаемых в меню «Файл».

source: These correspond to the letters used to invoke the main menu.
ru_ru: Это буквы, используемые для вызова элементов главного меню.

source: These files may be generated by other applications, exported from a spreadsheet, or even written by hand using Notepad or a similar text editor.
ru_ru: Данные файлы могут быть сформированы другими приложениями, экспортированы из таблиц, или даже составлены вручную в текстовом редакторе.

source: These files may then be used or modified by other applications.
ru_ru: Затем эти файлы могут быть использованы или изменены другими приложениями.

source: These have no Password Safe equivalent and are ignored
ru_ru: В Password Safe отсутствуют схожие поля, поэтому они игнорируются

source: These key combinations have been tested on a 102-key extended UK keyboard.
ru_ru: Указанные комбинации клавиш проверялись на 102-клавишной клавиатуре с расширенной английской раскладкой.

source: These may be useful if you wish to share the same preferences across several machines, for example, when running Password Safe from a disk-on-key.
ru_ru: Данные параметры могут оказаться полезными, если вы желаете использовать одни и те же настройки на разных машинах, например, при запуске Password Safe со съёмного диска.

source: These preferences apply to all databases on a given machine by a given user.
ru_ru: Эти параметры применяются ко всем контейнерам, открываемым данным пользователем на данной машине.

source: These preferences apply to all databases opened.
ru_ru: Эти параметры применяются ко всем открываемым контейнерам.

source: They can not be set independently.
ru_ru: Данные сочетания нельзя задать по отдельности.

source: They cannot be set independently.
ru_ru: Данные сочетания нельзя задать по отдельности.

source: They exist by virtue of an entry being present with within it or within a sub-group of the group.
ru_ru: Группа существует только если внутри неё или её подгруппы есть элементы.

source: They must only contain alphanumeric characters or one or more of the underscore, hyphen, colon or full stop characters ("_-:.").
ru_ru: Другие символы должны быть цифрами, буквами, или одним из следующих символов: подчёркивание («_»), дефис («-»), двоеточие («:») или точка («.»).

source: They work in a hierachy i.e. passwords can only be displayed if usernames are displayed.
ru_ru: Параметры отображения являются зависимыми: включить отображение паролей можно только когда выводятся имена пользователей.

source: The Go button to the right of the URL field is enabled if the URL field is not empty. Clicking with the Control key pressed (Ctrl+Click) will, in addition, invoke the autotype function on the opened browser page.
ru_ru: Щелчок с клавишей Control (Ctrl+Щелчок) вызывает автонабор на открытой в браузере странице.

source: This "dims out" the background screen and all other open windows.
ru_ru: В этом случае изображение фона рабочего стола и других окон будет затемнено.

source: This action displays a window that allows you to specify which characters of a password to display.
ru_ru: При выборе данного пункта отображается окно, позволяющее задать символы, которые необходимо показать.

source: This allows testers to verify the mini-dump production when Password Safe has a problem to help developers resolve the isssue.
ru_ru: Используется для проверки механизма создания минидампов процесса Password Safe.

source: This allows testers to verify the mini-dump production when Password Safe has a problem to help developers resolve the issue.
ru_ru: Используется для проверки механизма создания минидампов процесса Password Safe.

source: This allows you to 'program' fairly complex actions, such as invoking a remote access program (PuTTY, for example) and passing it the username and password associated with the entry.
ru_ru: Это позволяет производить некоторые сложные действия, например, запустить программу удалённого доступа (например, PuTTY) и передать ей имя пользователя и пароль, связанные с элементом.

source: This allows you to change the colour of the system tray icon displayed when Password Safe is initially started and when there's no open database.
ru_ru: Позволяет указать цвет значка Password Safe в области уведомлений (трее), когда контейнер не открыт.

source: This allows you to customize your optional YubiKey device so that you can use it to access your Password Safe database, as well as creating a backup YubiKey in case the original get lost or damaged.
ru_ru: Здесь вы можете настроить ключ YubiKey для доступа к контейнеру Password Safe, или создать его резервную копию, на случае повреждения или утери.

source: This allows you to define the following kinds of filters:
ru_ru: С помощью этого можно создать следующие виды фильтров:

source: This allows you to define what action Password Safe will take when you double-click on an entry.
ru_ru: Позволяет установить действие, которое Password Safe будет выполнять при двойном щелчке на элементе.

source: This allows you to define what action PasswordSafe will take when you double-click on an entry.
ru_ru: Позволяет установить действие, которое Password Safe будет выполнять при двойном щелчке на элементе.

source: This allows you to generate a password with a specified password policy to be put into the clipboard, by pushing Generate.
ru_ru: Создание пароля согласно выбранной политики и копирование его в буфер обмена.

source: This allows you to manage both the database default password policy and named password policies.
ru_ru: Позволяет управлять политикой паролей по умолчанию и именованными политиками паролей.

source: This allows you to select which commands appear on the toolbar, and in which order.
ru_ru: Выбор и перестановка команд, отображаемых на панели инструментов.

source: This allows you to set a default user name that will be used automatically every time a new password entry is generated.
ru_ru: Данная настройка позволяет указать имя пользователя, подставляемое при создании нового элемента.

source: This allows you to use your YubiKey to access your Password Safe database, either in addition to, or instead of a "Safe Combination".
ru_ru: В этом случае YubiKey может быть использован для доступа к контейнеру Password Safe вместо мастер-пароля или же в дополнение к нему.

source: This autotype sequence is meant to ensure that the user doesn't have to clear the username field first.
ru_ru: Эта последовательность избавляет пользователя от необходимости вручную очищать поле перед использованием автонабора.

source: This autotype sequence should ensure that the user doesn't have to clear a non-empty username field first.
ru_ru: Эта последовательность избавляет пользователя от необходимости вручную очищать поле перед использованием автонабора.

source: This can also be found on the main "Export To" menu off the File menu.
ru_ru: Указанные способы экспорта также доступны через подменю «Экспортировать в» в меню «Файл».

source: This can be as simple as a sealed envelope in a drawer or safe-deposit box, or a more elaborate mechanism such as splitting the master password and giving different parts to different parties.
ru_ru: В зависимости от ситуации, вы можете хранить пароль в запечатанном конверте в ячейке банка или, использовать более сложные методы, например, разделение пароля на несколько частей и предоставление частей для хранения различным людям.

source: This can be done either when the entry is created, or when viewing an existing entry.
ru_ru: Настройку можно задать при создании или редактировании элемента.

source: This can be done manually, or by using a cloud storage service such as DropBox, SugarSync or JungleDisk, to name a few.
ru_ru: Это может быть сделано вручную или с использованием «облачных сервисов» (например, DropBox, SugarSync или JungleDisk).

source: This can be overridden using this preference
ru_ru: Здесь можно переопределить её значение.

source: This can be overriden using this preference
ru_ru: Здесь можно переопределить её значение.

source: This can be useful if, for example, the AutoType is too fast for your machine.
ru_ru: Например, это может потребоваться, если автонабор выполняется слишком быстро.

source: This can be useful if, for example, the autotype is too fast for your machine.
ru_ru: Например, это может потребоваться, если автонабор выполняется слишком быстро.

source: This can be useful if, for example, the default AutoType timing is too fast for your machine.
ru_ru: Например, это может потребоваться, если автонабор выполняется слишком быстро.

source: This can be useful in cases where the drop "missed" by a pixel or two, allowing you to perform a paste operation, rather than trying to drag again.
ru_ru: Это может быть удобно, если при перетаскивании вы «промахнулись» на пару пикселей: в этом случае вместо повторного перетаскивания вы можете скопировать данные из буфера обмена.

source: This can be useful, for example, if the change failed to take effect at the site associated with this entry.
ru_ru: Это может пригодится в том случае, когда смена пароля на соответствующем сайте завершается ошибкой.

source: This causes the user name and password to be entered and submitted.
ru_ru: После этого имя пользователя и пароль будут введены и отправлены.

source: This changes the delay for the current and all subsequent characters.
ru_ru: Изменение задержки оказывает влияние только на текущий и последующие символы.

source: This clears the clipboard of anything that was pasted there by Password Safe (password, username, notes, etc.).
ru_ru: Из буфера удаляются все данные, помещённые туда Password Safe (имена, пароли, заметки, ...).

source: This could be to USB pen drives, external hard disks, network drives, CDs or DVDs etc.
ru_ru: Это могут быть Flash-диски, съёмные жёсткие диски, сетевые ресурсы, CD(DVD)-диски и прочие устройства, предназначенные для хранения данных.

source: This default can be changed via the Manage/Options menu (Misc. tab).
ru_ru: Действие по умолчанию может быть изменено на вкладке «Сервис→Настройки→Разное».

source: This determines how your entries will be displayed in the tree view when you open the database.
ru_ru: Определяет, как отображать элементы при открытии контейнера в режиме древовидного списка.

source: This dialog box allows you to export only some of the entries, based on the text in specified fields, and/or specify which fields are to be exported.
ru_ru: Здесь можно указать поля для экспорта и/или отобрать элементы по содержимому каких-либо полей.

source: This dialog box displays the last few previous passwords associated with a given entry.
ru_ru: Здесь отображаются несколько предыдущих паролей, связанных с данным элементом.

source: This does NOT occur with Firefox and Chrome browsers.
ru_ru: Этого не происходит с браузерами Firefox и Chrome.

source: This ensures that the resulting exported file is consistent.
ru_ru: Это необходимо для согласованности экспортируемых данных.

source: This feature is typically used as follows:
ru_ru: Данная функция обычно используется следующим образом:

source: This file is in XML format, with sections per host machine and per user, so that the file may be shared between different users, and across different machines.
ru_ru: Файл имеет формат XML. Для каждого пользователя и машины создаются отдельные элементы, чтобы несколько пользователей могли использовать один и тот же файл на различных машинах.

source: This file is only an example and you can easily modify it to display whatever fields you want to show. As this only displays the data and will not alter it, you will still be able to import it into Password Safe at some later time.
ru_ru: Так как стилевой файл влияет лишь на отображение данных, а не изменяет их, его содержимое не влияет на возможность импорта данных из XML-файла в контейнер Password Safe.

source: This file is used by Password Safe when XML data is imported, and should be provided to applications that wish to use the exported data.
ru_ru: Этот файл используется Password Safe при импорте данных из формата XML и может потребоваться приложениями, которые будут обрабатывать экспортированные данные.

source: This flag enables "Compare Entries" in the Tree view via an extra dialog to select the "other" entry.
ru_ru: Данный ключ добавляет в древовидном режиме пункт меню «Сравнить элементы...» и позволяет выбрать второй элемент из отдельного списка.

source: This functionality will only be enabled if the Hot Key to start or reopen Password Safe is active.
ru_ru: Данная функция доступна только в том случае, если задана комбинация клавиш, позволяющая отобразить окно Password Safe.

source: This functionaltity will only be enabled if the Hot Key to start or reopen Password Safe is active.
ru_ru: Данная функция доступна только в том случае, если задана комбинация клавиш, позволяющая отобразить окно Password Safe.

source: This functionaltity will only be enabled if the Hot Key to start or reopen Password Safe is avtive.
ru_ru: Данная функция доступна только в том случае, если задана комбинация клавиш, позволяющая отобразить окно Password Safe.

source: This has caused problems with recent versions of Windows when users were not given write access to this directory.
ru_ru: В новых версиях Windows это вызвало ряд проблем, связанных с тем что пользователи не имеют прав на запись в этот каталог.

source: This includes bot Latin and non-Latin characters
ru_ru: Используется как для латинских, так и для всех остальных символов

source: This includes both Latin and non-Latin characters
ru_ru: Используется как для латинских, так и для всех остальных символов

source: This is a very convenient combination.
ru_ru: Иногда это может быть очень удобным.

source: This is called "aliasing" entries, and is explained in detail here.
ru_ru: Использование псевдонимов подробно описано в соответствующем разделе.

source: This is called "aliasing" entries.
ru_ru: Связывание элементов таким образом производится с помощью псевдонимов.
